########################### 
print('Первое сравнение')

phrase_1 = 'Насколько проще было бы писать программы, если бы не заказчики'
phrase_2 = '640Кб должно хватить для любых задач. Билл Гейтс (по легенде)'

a = len(phrase_1)
b = len(phrase_2)

if a > b:
    print('Фраза 1 длиннее фразы 2')
if a < b:
    print('Фраза 2 длиннее фразы 1')
if a == b:
    print('Фразы равной длинны')        
###########################

print('Второе сравнение')

phrase_1 = '640Кб должно хватить для любых задач. Билл Гейтс (по легенде)'
phrase_2 = 'Насколько проще было бы писать программы, если бы не заказчики'

a = len(phrase_1)
b = len(phrase_2)

if a > b:
    print('Фраза 1 длиннее фразы 2')
if a < b:
    print('Фраза 2 длиннее фразы 1')
if a == b:
    print('Фразы равной длинны')
###########################

print('Третье сравнение')

phrase_1 = 'Насколько проще было бы писать программы, если бы не заказчики'
phrase_2 = 'Насколько проще было бы писать программы, если бы не заказчики'

a = len(phrase_1)
b = len(phrase_2)

if a > b:
    print('Фраза 1 длиннее фразы 2')
if a < b:
    print('Фраза 2 длиннее фразы 1')
if a == b:
    print('Фразы равной длинны')
    

    